app/Enrollment.php

    public static function getEnrollmentCard($grade_id, $institution_id)
    {
        $enrollments = self::
        join('headquarter', 'enrollment.headquarter_id', '=', 'headquarter.id')
            ->join('institution', 'headquarter.institution_id', '=', 'institution.id')
            ->join('student', 'student.id', '=', 'enrollment.student_id')
            ->join('group', 'group.id', '=', 'enrollment.group_id')
            ->join('grade', 'grade.id', '=', 'group.grade_id')
            ->where('institution.id', $institution_id)
            ->where('grade.id', '=', $grade_id)
            ->get();

        return $enrollments->all();
---
select * from `enrollment` inner join `headquarter` on `enrollment`.`headquarter_id` = `headquarter`.`id` inner join `institution` on `headquarter`.`institution_id` = `institution`.`id` inner join `student` on `student`.`id` = `enrollment`.`student_id` inner join `group` on `group`.`id` = `enrollment`.`group_id` inner join `grade` on `grade`.`id` = `group`.`grade_id` where `institution`.`id` = '7' and `grade`.`id` is null
select * from `enrollment` inner join `headquarter` on `enrollment`.`headquarter_id` = `headquarter`.`id` inner join `institution` on `headquarter`.`institution_id` = `institution`.`id` inner join `student` on `student`.`id` = `enrollment`.`student_id` inner join `group` on `group`.`id` = `enrollment`.`group_id` inner join `grade` on `grade`.`id` = `group`.`grade_id` where `group`.`headquarter_id` = '15' and `institution`.`id` = '7' and `grade`.`id` = '4'