app/Student.php

select `family_relationship_student`.`relationship_id` from `student` inner join `family_relationship_student` on `student`.`id` = `family_relationship_student`.`student_id` where `student`.`id` = '109' and `family_relationship_student`.`family_id` = '163'
---
    public  static function getParents($student_id, $family_student){
        return Student::join('family_relationship_student', 'student.id', '=', 'family_relationship_student.student_id')
            ->select('family_relationship_student.relationship_id')
            ->where('student.id', $student_id)
            ->where('family_relationship_student.family_id', $family_student)
            ->get()[0];