app/Helpers/GenerateEnrollmentCard.php

    public function generateEnrollmentCard($enrollment_card, $institution_id)
    {
        $institution = Institution::findOrfail($institution_id);

        foreach ($enrollment_card as $enrollment) {
            date_default_timezone_set('UTC');
            $this->AddPage('P', 'Letter');
            $this->myHeader($institution->name);

            $headquarter = Headquarter::findOrfail($enrollment->headquarter_id);

            $lineas = 0;

            # Sesion formato de matricula de estudiante
            $this->Cell(119.5, 8, '', $lineas, 0, 'C');
            if (1 == 0) {
                //Nuevo
                $this->Cell(39.5, 8, "", $lineas, 0, 'C');
                $this->Cell(39.5, 8, "", $lineas, 1, 'C');
            } else {
                //Continuidad
                $this->Cell(39.5, 8, "", $lineas, 0, 'C');
                $this->Cell(40, 8, '', $lineas, 1, 'C');
            }
            $this->ln(4);
            $grade_enrollment = Grade::findOrfail(Group::findOrfail($enrollment->group->id)->grade_id)->name;
---
select * from `institution` where `institution`.`id` = '7' limit 1
select * from `headquarter` where `headquarter`.`id` = '19' limit 1
select * from `grade` where `grade`.`id` = '10' limit 1
select * from `group` where `group`.`id` = '78' limit 1

            /*
             Datos de identificación del estudiante
            */
            $student = Student::findOrfail($enrollment->student_id);
---
select * from `student` where `student`.`id` = '27' limit 1

            $this->Cell(39.7, 3.6, strtoupper(utf8_decode($address->phone)), $lineas, 0, 'C');


            $enrollment_level = Grade::findOrfail($enrollment->group->grade_id)->academic_level_id;
---
select * from `grade` where `grade`.`id` = '4' limit 1
select * from `group` where `group`.`id` = '78' limit 1

            $subsidiado = $student->academicInformation->has_subsidy;
            //$interno = strtoupper(utf8_decode($estudiante['interno']));
            //$otro_modelo = strtoupper(utf8_decode($estudiante['otro_modelo']));
            $caracter = AcademicInformation::findOrfail($student->academicInformation->id)->academic_character_id;
---
select * from `academic_character` where `academic_character`.`id` is null limit 1
select * from `academic_information` where `academic_information`.`id` = '7' limit 1