app/Http/Controllers/EnrollmentController.php

    public function lists($state)
    {
        $institution_id = Auth::guard('web_institution')->user()->id;

        // dd($institution_id);

        $enrollments = Enrollment::getByState($state, $institution_id);

        $enrollments->each(function ($enrollments) {
            $enrollments->student->identification->identification_type;
            $enrollments->headquarter;
        });
---
select * from `identification` where `identification`.`id` = '58' limit 1
select * from `student` where `student`.`id` = '27' limit 1
select * from `headquarter` where `headquarter`.`id` = '15' limit 1

    public function cardGrade()
    {

        $grades = Grade::all();
---
select * from `grade`